docs/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Vernon Grant</title>
<meta name="author" content="Vernon Grant" />
<meta name="description" content="Welcome to my personal blog where I cover a variety of programming related topics" />
<meta name="keywords" content="Emacs, Programming, Coding" />
<meta name="generator" content="Org Mode" />
<link rel="icon" href="https://www.vernon-grant.com/cropped-favicon-32x32.png" sizes="32x32" /><link rel="icon" href="https://www.vernon-grant.com/cropped-favicon-192x192.png" sizes="192x192" /><link rel="apple-touch-icon" href="https://www.vernon-grant.com/cropped-favicon-180x180.png" /><link rel="stylesheet" href="https://www.vernon-grant.com/stylesheet.css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Vernon Grant
<br>
<span class="subtitle">Welcome to my personal blog where I cover a variety of programming related topics</span>
</h1>
<ul class="org-ul">
<li>C
<ul class="org-ul">
<li><a href="C/structure-padding-and-alignment.html">Structure Padding and Alignment</a></li>
</ul></li>
<li>Common-Lisp
<ul class="org-ul">
<li><a href="Common-Lisp/searching-for-the-one-true-lisp.html">Searching for the one true lisp</a></li>
</ul></li>
<li>Emacs
<ul class="org-ul">
<li><a href="Emacs/tmux-emacs-and-the-system-clipboard-on-wayland.html">Tmux, Emacs and The System Clipboard on Wayland</a></li>
<li>Discovering-Emacs
<ul class="org-ul">
<li><a href="Emacs/Discovering-Emacs/1-finding-files-recursively-using-locate.html">1 - Finding Files Recursively Using Locate</a></li>
<li><a href="Emacs/Discovering-Emacs/2-efficiency-with-the-mark-ring.html">2 - Efficiency With The Mark Ring</a></li>
<li><a href="Emacs/Discovering-Emacs/3-making-incremental-search-work-for-you.html">3 - Making Incremental Search Work for You</a></li>
<li><a href="Emacs/Discovering-Emacs/4-using-whitespace-mode.html">4 - Using Whitespace Mode</a></li>
<li><a href="Emacs/Discovering-Emacs/5-essential-movement-and-editing-shortcuts.html">5 - Essential Movement and Editing Shortcuts</a></li>
</ul></li>
</ul></li>
<li>Linux
<ul class="org-ul">
<li><a href="Linux/linux-groups-explained.html">Linux Groups Explained</a></li>
</ul></li>
<li>Software-Design
<ul class="org-ul">
<li><a href="Software-Design/how-to-write-good-code-comments.html">How To Write Good Code Comments</a></li>
</ul></li>
<li>Vim
<ul class="org-ul">
<li><a href="Vim/vertical-navigation-in-vim.html">Vertical Navigation in Vim</a></li>
</ul></li>
</ul>
</div>
<div id="postamble" class="status">
<p class="author">Author: Vernon Grant (<a href="mailto:info@vernon-grant.com">info@vernon-grant.com</a>)</p>
<p class="updated">Updated on: 2024-10-11 Fri 18:48</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.1 (<a href="https://orgmode.org">Org</a> mode 9.6.6)</p>
<p class="validation"></p>
</div>
</body>
</html>
